data/data.xml

<?xml version="1.0" encoding="UTF-8"?>\n
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://gim.nl/schemas/gim"
                   xmlns:ns2="http://gim.nl/ws/gim">
    <SOAP-ENV:Body>
        <ns2:doeFunctie>
            <ns1:doeFunctieVraag>
                <ns1:procesInfo>
                    <ns1:procesId>EMS8888940003639</ns1:procesId>
                    <ns1:procesStatus>Compleet</ns1:procesStatus>
                    <ns1:functie>
                        <ns1:productId>0</ns1:productId>
                        <ns1:contextId>200</ns1:contextId>
                        <ns1:functieId>2026</ns1:functieId>
                    </ns1:functie>
                    <ns1:procesOmschrijving>Testberricht verstuurd vanuit advies4me</ns1:procesOmschrijving>
                </ns1:procesInfo>
                <ns1:inhoud>
                    <ns1:gimData>&lt;![CDATA[\n
                        &lt;Contractdocument&gt;\n
                        &lt;AL&gt;\n
                        &lt;AL_ENTITEI&gt;AL&lt;/AL_ENTITEI&gt;\n
                        \t\t &lt;AL_VRWRKCD&gt;0&lt;/AL_VRWRKCD&gt;\n
                        \t\t &lt;AL_FUNCTIE&gt;22&lt;/AL_FUNCTIE&gt;\n
                        \t\t &lt;AL_COREF&gt;support@sivi.org&lt;/AL_COREF&gt;\t\t \n
                        \t\t &lt;AL_ADATMSG&gt;20180401&lt;/AL_ADATMSG&gt;\n
                        \t\t &lt;AL_ATYDMSG&gt;1200&lt;/AL_ATYDMSG&gt;\n
                        \t\t &lt;AL_SKPSID&gt;999-9999&lt;/AL_SKPSID&gt;\n
                        \t\t &lt;/AL&gt;\n
                        &lt;/Contractdocument&gt;]]&gt;
                    </ns1:gimData>
                </ns1:inhoud>
            </ns1:doeFunctieVraag>
        </ns2:doeFunctie>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>\n
